In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.dropna().reindex()

1    artichoke
3      avocado
dtype: object

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
   ....:                      [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [19]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [23]:
df

          0         1         2
0 -1.547139       NaN       NaN
1 -1.255995       NaN       NaN
2  1.349623       NaN -0.292282
3 -2.017333       NaN  1.081873
4  1.458021 -0.049576 -1.881953
5  2.408867 -0.071099  1.058487
6  1.486475 -0.839364 -0.621287

In [24]:
df.dropna()

          0         1         2
4  1.458021 -0.049576 -1.881953
5  2.408867 -0.071099  1.058487
6  1.486475 -0.839364 -0.621287

In [29]:
df.dropna(thresh=2)

          0         1         2
2  1.349623       NaN -0.292282
3 -2.017333       NaN  1.081873
4  1.458021 -0.049576 -1.881953
5  2.408867 -0.071099  1.058487
6  1.486475 -0.839364 -0.621287

In [30]:
df.iloc[0,0] =NA

In [43]:
df[3] = 4

In [47]:
df

          0         1         2  3
0       NaN       NaN       NaN  4
1 -1.255995       NaN       NaN  4
2  1.349623       NaN -0.292282  4
3  4.000000  4.000000  4.000000  4
4  1.458021 -0.049576 -1.881953  4
5  2.408867 -0.071099  1.058487  4
6  1.486475 -0.839364 -0.621287  4

In [46]:
df.dropna(thresh=2)

          0         1         2  3
1 -1.255995       NaN       NaN  4
2  1.349623       NaN -0.292282  4
3  4.000000  4.000000  4.000000  4
4  1.458021 -0.049576 -1.881953  4
5  2.408867 -0.071099  1.058487  4
6  1.486475 -0.839364 -0.621287  4

In [48]:
df.fillna(0)

          0         1         2  3
0  0.000000  0.000000  0.000000  4
1 -1.255995  0.000000  0.000000  4
2  1.349623  0.000000 -0.292282  4
3  4.000000  4.000000  4.000000  4
4  1.458021 -0.049576 -1.881953  4
5  2.408867 -0.071099  1.058487  4
6  1.486475 -0.839364 -0.621287  4

In [49]:
df.fillna({1:0.5, 2:0.3})

          0         1         2  3
0       NaN  0.500000  0.300000  4
1 -1.255995  0.500000  0.300000  4
2  1.349623  0.500000 -0.292282  4
3  4.000000  4.000000  4.000000  4
4  1.458021 -0.049576 -1.881953  4
5  2.408867 -0.071099  1.058487  4
6  1.486475 -0.839364 -0.621287  4

In [50]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [51]:
df

          0         1         2
0  0.913712  1.490634 -0.743978
1  0.347326  0.717283 -2.303604
2 -0.806648       NaN  1.530137
3 -0.162392       NaN  0.665564
4 -0.018708       NaN       NaN
5  0.420624       NaN       NaN

In [52]:
# ffill 填充前面值，bfill填充后面值
df.fillna(method="ffill")

          0         1         2
0  0.913712  1.490634 -0.743978
1  0.347326  0.717283 -2.303604
2 -0.806648  0.717283  1.530137
3 -0.162392  0.717283  0.665564
4 -0.018708  0.717283  0.665564
5  0.420624  0.717283  0.665564

In [53]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.913712  1.490634 -0.743978
1  0.347326  0.717283 -2.303604
2 -0.806648  0.717283  1.530137
3 -0.162392  0.717283  0.665564
4 -0.018708       NaN  0.665564
5  0.420624       NaN  0.665564

In [54]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [55]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [56]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
   ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [57]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [62]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [63]:
data.drop_duplicates(keep="last")

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [64]:
data.drop_duplicates(subset=["k1"])

    k1  k2
0  one   1
1  two   1

In [65]:
data.drop_duplicates(subset=["k1", "k2"],keep="last")

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [67]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   ....:                               'Pastrami', 'corned beef', 'Bacon',
   ....:                               'pastrami', 'honey ham', 'nova lox'],
   ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [68]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [69]:
data["food"].str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [70]:
data["food"].map(lambda x: x.lower())

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [71]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [72]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [74]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [75]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [76]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [78]:
data.index.map(lambda x:x.upper())

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [79]:
data.index.map(lambda x: x.title())

array(['Ohio', 'Colorado', 'New York'], dtype=object)

In [80]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [83]:
data.rename(index={'Ohio': 'INDIANA'},
   ....:             columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [84]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11